//HLASMNRE PROC SRC=
//*
//ASM      EXEC PGM=ASMA90,REGION=0M,
// PARM='GOFF,NODECK,LIST(133),XREF(SHORT)'
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=SYS1.MODGEN,DISP=SHR
//SYSIN    DD DSN=SYSP.ZNBRIDGE.SRCLIB(&SRC),DISP=SHR
//SYSLIN   DD DISP=SHR,DSN=SYSP.ZNBRIDGE.OBJLIB(&SRC)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(10,10))
//*
//BIND     EXEC PGM=IEWBLINK,REGION=0M,COND=(4,LT),
// PARM='LIST,MAP,XREF,CASE=MIXED'
//SYSLIB   DD DSN=CBC.SCCNOBJ,DISP=SHR
//         DD DISP=SHR,DSN=SYS1.CSSLIB
//         DD DSN=SYSP.ZNBRIDGE.LODLIB,DISP=SHR
//OBJLIB   DD DISP=SHR,DSN=SYSP.ZNBRIDGE.OBJLIB
//SYSLIN   DD DISP=SHR,DSN=SYSP.ZNBRIDGE.OBJLIB(&SRC)
//         DD DDNAME=SYSIN
//SYSLMOD  DD DISP=SHR,DSN=SYSP.ZNBRIDGE.LODLIB(&SRC)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(10,10))
